vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA154_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA154_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA154_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA154/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA154/MCXA154.h" projectpath="device"/>
        <file category="header" name="devices/MCXA154/MCXA154_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA154/MCXA154_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_ADC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_AOI.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_CAN.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_CDOG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_CMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_CRC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_CTIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_DEBUGMAILBOX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_DMA.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_EIM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_EQDC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_ERM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_FLEXIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_FMC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_FMU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_FMUTEST.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_FREQME.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_GLIKEY.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_GPIO.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_I3C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_INPUTMUX.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_LPCMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_LPDAC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_LPI2C.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_LPSPI.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_LPTMR.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_LPUART.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_MRCC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_OPAMP.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_OSTIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_PORT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_PWM.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_SCG.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_SPC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_SYSCON.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_TRDC.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_USB.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_UTICK.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_VBAT.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_WAKETIMER.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_WUU.h" projectpath="device/periph1"/>
        <file category="header" name="devices/MCXA154/periph1/PERI_WWDT.h" projectpath="device/periph1"/>
        <file category="include" name="devices/MCXA154/"/>
        <file category="include" name="devices/MCXA154/periph1/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA154/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA154/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA154_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA154_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA154.condition_id" category="linkerScript" name="devices/MCXA154/arm/MCXA154_flash.scf" projectpath="MCXA154/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA154.condition_id" category="linkerScript" name="devices/MCXA154/arm/MCXA154_ram.scf" projectpath="MCXA154/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA154.condition_id" category="linkerScript" name="devices/MCXA154/gcc/MCXA154_flash.ld" projectpath="MCXA154/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA154.condition_id" category="linkerScript" name="devices/MCXA154/gcc/MCXA154_ram.ld" projectpath="MCXA154/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA154.condition_id" category="linkerScript" name="devices/MCXA154/iar/MCXA154_flash.icf" projectpath="MCXA154/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA154.condition_id" category="linkerScript" name="devices/MCXA154/iar/MCXA154_ram.icf" projectpath="MCXA154/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA154" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA154</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA154/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA154/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA154/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA154/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA154/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA154/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA154/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA154/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA154/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA154_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXA154/iar/startup_MCXA154.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXA154/gcc/startup_MCXA154.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXA154/arm/startup_MCXA154.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
