vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA154_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-dbi" Cversion="1.0.0" condition="driver.dc-fb-dbi.condition_id">
      <description>Driver dc-fb-dbi</description>
      <RTE_Components_h>
#ifndef MCUX_DBI_LEGACY
#define MCUX_DBI_LEGACY 0
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/dbi/fsl_dc_fb_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-ssd1963" Cversion="1.0.2" condition="driver.dc-fb-ssd1963.condition_id">
      <description>Driver dc-fb-ssd1963</description>
      <files>
        <file category="header" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.c" projectpath="video"/>
        <file category="include" name="components/video/display/dc/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-adv7535" Cversion="1.0.1" condition="driver.display-adv7535.condition_id">
      <description>Driver display-adv7535</description>
      <files>
        <file category="header" name="components/video/display/adv7535/fsl_adv7535.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/adv7535/fsl_adv7535.c" projectpath="video"/>
        <file category="include" name="components/video/display/adv7535/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-common" Cversion="1.0.0" condition="driver.display-common.condition_id">
      <description>Driver display-common</description>
      <files>
        <file category="header" name="components/video/display/fsl_display.h" projectpath="video"/>
        <file category="include" name="components/video/display/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6161" Cversion="1.0.0" condition="driver.display-it6161.condition_id">
      <description>Driver display-it6161</description>
      <files>
        <file category="header" name="components/video/display/it6161/fsl_it6161.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/fsl_it6161.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/hdmi_tx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/hdmi_tx.c" projectpath="video"/>
        <file category="header" name="components/video/display/it6161/mipi_rx.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6161/mipi_rx.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6161/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-it6263" Cversion="1.0.1" condition="driver.display-it6263.condition_id">
      <description>Driver display-it6263</description>
      <files>
        <file category="header" name="components/video/display/it6263/fsl_it6263.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/it6263/fsl_it6263.c" projectpath="video"/>
        <file category="include" name="components/video/display/it6263/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="display-sn65dsi83" Cversion="1.0.0" condition="driver.display-sn65dsi83.condition_id">
      <description>Driver display-sn65dsi83</description>
      <files>
        <file category="header" name="components/video/display/sn65dsi83/fsl_sn65dsi83.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/sn65dsi83/fsl_sn65dsi83.c" projectpath="video"/>
        <file category="include" name="components/video/display/sn65dsi83/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.10.6" condition="driver.edma4.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXA154/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXA154/drivers/fsl_edma_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc" Cversion="2.0.0" condition="driver.edma_soc.condition_id">
      <description>EDMA SOC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_edma_soc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA154/drivers/fsl_edma_soc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eim" Cversion="2.0.2" condition="driver.eim.condition_id">
      <description>EIM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_eim.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA154/drivers/fsl_eim.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ektf2k" Cversion="1.0.0" condition="driver.ektf2k.condition_id">
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/ektf2k/fsl_ektf2k.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ektf2k/fsl_ektf2k.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ektf2k/"/>
      </files>
    </component>
