vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA154_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="opamp" Cversion="2.2.1" condition="driver.opamp.condition_id">
      <description>OPAMP Driver</description>
      <files>
        <file category="header" name="devices/MCXA154/drivers/fsl_opamp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_opamp.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.5" condition="driver.ostimer.condition_id">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXA154/drivers/fsl_ostimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_ostimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="port" Cversion="2.5.1" condition="driver.port.condition_id">
      <description>PORT Driver</description>
      <files>
        <file category="header" name="devices/MCXA154/drivers/fsl_port.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA154/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.4.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA154/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="2.0.1" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/MCXA154/drivers/fsl_romapi.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963" Cversion="1.2.0" condition="driver.ssd1963.condition_id">
      <description>Driver ssd1963</description>
      <files>
        <file category="header" name="components/display/ssd1963/fsl_ssd1963.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ssd1963/fsl_ssd1963.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="st7796s" Cversion="1.0.0" condition="driver.st7796s.condition_id">
      <description>Driver st7796s</description>
      <files>
        <file category="header" name="components/display/st7796s/fsl_st7796s.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/st7796s/fsl_st7796s.c" projectpath="lcdc"/>
        <file category="include" name="components/display/st7796s/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tma525b" Cversion="1.0.0" condition="driver.tma525b.condition_id">
      <description>Driver tma525b</description>
      <files>
        <file category="header" name="components/touch/tma525b/fsl_tma525b.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/tma525b/fsl_tma525b.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/tma525b/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trdc" Cversion="2.2.1" condition="driver.trdc_1.condition_id">
      <description>TRDC Driver</description>
      <files>
        <file category="header" name="devices/MCXA154/drivers/fsl_trdc.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXA154/drivers/fsl_trdc_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA154/drivers/fsl_trdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA154/drivers/"/>
      </files>
    </component>
